{
	"@metadata": {
		"authors": [
			"Ajeje Brazorf",
			"Lakejason0",
			"Shirayuki",
			"Verdy p"
		]
	},
	"skinname-lakeus": "{{name}}",
	"lakeus-skin-desc": "{{desc|what=skin|name=Lakeus|url=https://www.mediawiki.org/wiki/Skin:Lakeus}}",
	"lakeus.css": "{{optional}}\n{{related/css}}",
	"lakeus.js": "{{optional}}\n{{related/js}}",
	"lakeus-openmainmenu": "The title and label for the sidebar menu.",
	"lakeus-jumptocontent": "The “Jump to content” link's text that is only accessible via the keyboard.",
	"lakeus-articlecount": "Article counter in the sidebar menu, e.g. 1 Article, 2 Articles. For languages (e.g. Chinese) that needs a delimiter/quantifier (e.g. in Chinese it's smoother to say 1篇文章), be sure to add it.",
	"lakeus-footermessage": "The footer message show on every page, linking to the repository. Can be disabled through <code>LakeusShowRepositoryLink</code>.",
	"lakeus-preferences-enable-theme-designer": "A preference label. Checking this checkbox will enable Theme Designer on every page.",
	"lakeus-preferences-enable-theme-designer-desc": "A preference description. Enable Lakeus Theme Designer on every page.",
	"lakeus-preferences-sticky-toc-donot-auto-collapse": "A preference label. Checking this checkbox will make it not close sticky TOC when clicking on sticky TOC anchors (links). Alternatively, translate \"sticky TOC\" as \"floating TOC\".",
	"lakeus-preferences-sticky-toc-donot-auto-collapse-desc": "A preference description. Alternatively, translate \"sticky TOC\" as \"floating TOC\".",
	"lakeus-preferences-smooth-scroll-behavior": "A preference label. Checking this checkbox will enable animation on page scrolling.",
	"lakeus-preferences-smooth-scroll-behavior-desc": "A preference description. Checking the corresponding checkbox will enable animation on page scrolling.",
	"lakeus-theme-designer": "The title of Lakeus Theme Designer form.",
	"lakeus-theme-designer-system-messages-loaded": "A message appearing in the console, indicating that system messages (l10n) are successfully loaded.",
	"lakeus-theme-designer-all-loaded": "A message appearing in the console, indicating that the Theme Designer is all loaded.",
	"lakeus-theme-designer-auto-calculate": "A checkbox label. Checking these will disable the corresponding form input and use the automatic calculation provided by the designer for the corresponding setting.",
	"lakeus-theme-designer-do-not-generate": "A checkbox label. Checking these will disable the generation of the corresponding setting when generating the theme.",
	"lakeus-theme-designer-copy-theme": "A form button. Click it to copy theme CSS code to the clipboard.",
	"lakeus-theme-designer-paste-theme": "A form button. Click it to paste current settings to the form.",
	"lakeus-theme-designer-test-theme": "A form button. Click it to test the theme out.",
	"lakeus-theme-designer-clear-theme": "A form button. Click it to end testing.",
	"lakeus-theme-designer-reset-theme": "A form button. Click it to reset the form.\n\n{{Identical|Reset}}",
	"lakeus-theme-designer-invert-auto-calculate-selection": "A form button. Click it to invert the automatic calculation selection.",
	"lakeus-theme-designer-unselect-do-not-generate-selection": "A form button. Click it to unselect do not generate selection.",
	"lakeus-theme-designer-copied": "A notification text. Shows when theme code is successfully copied to the clipboard.",
	"lakeus-theme-designer-copy-failed": "A notification text. Shows when theme code fails to be copied to the clipboard, instead going into the &lt;pre&gt; element at the end of the designer.",
	"lakeus-theme-designer-reload": "A form button. Click it to reload the designer.",
	"lakeus-theme-designer-color-picker-fallback": "A checkbox label. Checking it will change color pickers to text inputs for fallback use.",
	"lakeus-theme-designer-alpha-channel": "A form input placeholder for alpha channel (opacity). It's probably a good idea to keep Alpha as-is, but don't if your language's grammar is against it.",
	"lakeus-theme-designer-basic": "A form section title. Settings in this section are the most important ones, as they are the base variables that auto calculation depends on.",
	"lakeus-theme-designer-color-primary": "A label of a setting. The primary (or accent, foreground) color.",
	"lakeus-theme-designer-color-secondary": "A label of a setting. The secondary (used as background) color.",
	"lakeus-theme-designer-color-neutral": "A label of a setting. The neutral color, used on neutral notifications or alike.",
	"lakeus-theme-designer-color-warning": "A label of a setting. The warning color, used on warning notifications or alike.",
	"lakeus-theme-designer-color-error": "A label of a setting. The error color, used on error notifications or alike.",
	"lakeus-theme-designer-color-success": "A label of a setting. The successful color, used on successful notifications or alike.",
	"lakeus-theme-designer-basic-derived": "A form section title. Settings in this section are the derivation of basic settings.",
	"lakeus-theme-designer-color-secondary--derived": "A label of a setting. The derivation of the Secondary color.",
	"lakeus-theme-designer-border-color-secondary--derived": "A label of a setting. The derivation of the Secondary color used in borders.",
	"lakeus-theme-designer-global": "A form section title. Settings in this section will affect the whole page.\n{{Identical|Global}}",
	"lakeus-theme-designer-background-color-base": "HTML background color, or the background color of the <code>&lt;html&gt;</code> element.",
	"lakeus-theme-designer-color-link": "A label of a setting. The color of normal links.",
	"lakeus-theme-designer-color-link--visited": "A label of a setting. The color of visited links.",
	"lakeus-theme-designer-color-link--active": "A label of a setting. The color of active links.",
	"lakeus-theme-designer-color-link-new": "A label of a setting. The color of new links.",
	"lakeus-theme-designer-color-link-new--visited": "A label of a setting. The color of visited new links.",
	"lakeus-theme-designer-color-link-new--active": "A label of a setting. The color of active new links.",
	"lakeus-theme-designer-color-footer-link": "A label of a setting. The color of footer links.",
	"lakeus-theme-designer-color-footer-link--visited": "A label of a setting. The color of visited footer links.",
	"lakeus-theme-designer-color-footer-link--active": "A label of a setting. The color of active footer links.",
	"lakeus-theme-designer-color-link-external": "A label of a setting. The color of external links.",
	"lakeus-theme-designer-color-link-external--visited": "A label of a setting. The color of visited external links.",
	"lakeus-theme-designer-color-link-external--active": "A label of a setting. The color of active external links.",
	"lakeus-theme-designer-elevation": "A label of a setting. Shadow setting that is used by several elements.",
	"lakeus-theme-designer-font-family": "A label of a setting. Default font family that is applied to the whole page.",
	"lakeus-theme-designer-font-family-serif": "A label of a setting. Default serif font family. Could be applied to the headings.",
	"lakeus-theme-designer-font-family-action-bar": "A label of a setting. Font family applied to the action bar.",
	"lakeus-theme-designer-page-header": "A form section title. Settings in this section will affect the page header.",
	"lakeus-theme-designer-color-header": "A label of a setting. The background color of the header.",
	"lakeus-theme-designer-header-elevation": "A label of a setting. Shadow setting that is used by the header.",
	"lakeus-theme-designer-icon-filter-header": "A label of a setting. The filter of the header icons.",
	"lakeus-theme-designer-background-color-search-suggestions": "A label of a setting. The background color of these search suggestions that would pop up below the search bar.",
	"lakeus-theme-designer-border-color-search-suggestions": "A label of a setting. The border color of the search suggestion panel that would pop up below the search bar.",
	"lakeus-theme-designer-color-search-suggestions-text": "A label of a setting. The text color of these search suggestions that would pop up below the search bar.",
	"lakeus-theme-designer-background-color-search-suggestions-current": "A label of a setting. The background color of the selected (hovered) search suggestion.",
	"lakeus-theme-designer-color-search-suggestions-text-current": "A label of a setting.  text color of the selected (hovered) search suggestion.",
	"lakeus-theme-designer-background-color-search-input": "A label of a setting. The background color of the search bar.",
	"lakeus-theme-designer-border-color-search-bar": "A label of a setting. The border color of the search bar.",
	"lakeus-theme-designer-toggle-list": "A form section title. Settings in this section will affect the sidebar menu.",
	"lakeus-theme-designer-background-color-toggle-list": "A label of a setting. The background color of the sidebar menu.",
	"lakeus-theme-designer-background-color-toggle-list-card": "A label of a setting. The background color of the card at the top of the sidebar menu.",
	"lakeus-theme-designer-logo-text-color-toggle-list": "A label of a setting. The text color of the logo and the article counter in the card at the top of the sidebar menu.",
	"lakeus-theme-designer-background-color-toggle-list-item-hover": "A label of a setting. The color of the sidebar menu items hovered on.",
	"lakeus-theme-designer-background-color-toggle-list-item-focus": "A label of a setting. The color of the sidebar menu items clicked.",
	"lakeus-theme-designer-border-color-toggle-list": "A label of a setting. The color of the borders that separate different sections of the sidebar menu.",
	"lakeus-theme-designer-subheader-color-toggle-list": "A label of a setting. The text color of the subheaders in the sidebar menu.",
	"lakeus-theme-designer-mask-background": "A label of a setting. The sidebar menu mask (by default the dimmed part) background.",
	"lakeus-theme-designer-body": "A form section title. Settings in this section will affect the page body.",
	"lakeus-theme-designer-background-color-content": "A label of a setting. Body background color, or the background color of the <code>&lt;body&gt;</code> element.",
	"lakeus-theme-designer-background-color-body": "A label of a setting. The background color of the content area, including site notice, the actual page content, categories and so on.",
	"lakeus-theme-designer-border-color-content": "A label of a setting. The bordor color of some skin elements in the content area, including site notice and categories.",
	"lakeus-theme-designer-color-accent-header-tab": "A label of a setting. The text color of the action header tabs.",
	"lakeus-theme-designer-border-color-header-tab": "A label of a setting. The border color of the action header tabs.",
	"lakeus-theme-designer-color-tagline": "A label of a setting. The color of the tagline.",
	"lakeus-theme-designer-font-family-headings": "A label of a setting. Font family of the headings.",
	"lakeus-theme-designer-background-color-edit-options": "A label of a setting. The background color of these edit options in wiki editor.",
	"lakeus-theme-designer-border-color-edit-options": "A label of a setting. The border color of these edit options in wiki editor.",
	"lakeus-theme-designer-background-color-toc": "A label of a setting. The background color of the table of contents.",
	"lakeus-theme-designer-border-color-toc": "A label of a setting. The border color of the table of contents.",
	"lakeus-theme-designer-color-toc-number": "A label of a setting. The text color of the title numbers in the table of contents.",
	"lakeus-theme-designer-border-color-interface-message-box-neutral": "A label of a setting. The border color of the neutral message box.",
	"lakeus-theme-designer-background-color-interface-message-box-neutral": "A label of a setting. The background color of the neutral message box.",
	"lakeus-theme-designer-text-color-interface-message-box-neutral": "A label of a setting. The text color of the neutral message box.",
	"lakeus-theme-designer-border-color-interface-message-box-warning": "A label of a setting. The border color of the warning message box.",
	"lakeus-theme-designer-background-color-interface-message-box-warning": "A label of a setting. The background color of the warning message box.",
	"lakeus-theme-designer-text-color-interface-message-box-warning": "A label of a setting. The text color of the warning message box.",
	"lakeus-theme-designer-border-color-interface-message-box-error": "A label of a setting. The border color of the error message box.",
	"lakeus-theme-designer-background-color-interface-message-box-error": "A label of a setting. The background color of the error message box.",
	"lakeus-theme-designer-text-color-interface-message-box-error": "A label of a setting. The text color of the error message box.",
	"lakeus-theme-designer-border-color-interface-message-box-success": "A label of a setting. The border color of the success message box.",
	"lakeus-theme-designer-background-color-interface-message-box-success": "A label of a setting. The background color of the success message box.",
	"lakeus-theme-designer-text-color-interface-message-box-success": "A label of a setting. The text color of the success message box.",
	"lakeus-theme-designer-border-color-user-message": "A label of a setting. The border color of the message box informing users about their talk pages.",
	"lakeus-theme-designer-background-color-user-message": "A label of a setting. The background color of the message box informing users about their talk pages.",
	"lakeus-theme-designer-text-color-user-message": "A label of a setting. The text color of the message box informing users about their talk pages.",
	"lakeus-theme-designer-background-color-wikitable": "A label of a setting. The background color of the table.",
	"lakeus-theme-designer-border-color-wikitable": "A label of a setting. The border color of the table.",
	"lakeus-theme-designer-background-color-wikitable-table-head": "A label of a setting. The background color of the table header.",
	"lakeus-theme-designer-text-color-wikitable": "A label of a setting. The text color of the table.",
	"lakeus-theme-designer-portlet": "A form section title. Settings in this section will affect the dropdown menus.",
	"lakeus-theme-designer-background-color-portlet-body": "A label of a setting. The background color of dropdown menus.",
	"lakeus-theme-designer-text-color-portlet-item": "A label of a setting. The text color of dropdown menus.",
	"lakeus-theme-designer-background-color-portlet-item-hover": "A label of a setting. The color of the dropdown menu items hovered on.",
	"lakeus-theme-designer-text-color-portlet-item-hover": "A label of a setting. The text color of the dropdown menu items hovered on.",
	"lakeus-theme-designer-background-color-portlet-item-focus": "A label of a setting. The color of the dropdown menu items clicked.",
	"lakeus-theme-designer-text-color-portlet-item-focus": "A label of a setting. The text color of the dropdown menu items clicked.",
	"lakeus-theme-designer-border-color-portlet-body": "A label of a setting. The border color of dropdown menus.",
	"lakeus-theme-designer-footer": "A form section title. Settings in this section will affect the footer.",
	"lakeus-theme-designer-background-color-footer": "A label of a setting. The background color of the footer.",
	"lakeus-theme-designer-text-color-footer": "The text color of the footer.",
	"lakeus-theme-designer-text-color-toggle-list-item": "A label of a setting. The text color of sidebar menu items.",
	"lakeus-theme-designer-text-color-toggle-list-item-hover": "A label of a setting. The text color of sidebar menu items hovered on.",
	"lakeus-theme-designer-text-color-toggle-list-item-focus": "A label of a setting. The text color of sidebar menu items clicked.",
	"lakeus-theme-designer-text-color-content": "A label of a setting. The text color of the content area.",
	"lakeus-theme-designer-text-color-header": "A label of a setting. The text color of the header.",
	"lakeus-theme-designer-text-color-body": "A label of a setting. The text color of the body.",
	"lakeus-theme-designer-color-accent-header-tab-selected": "A label of a setting. The text color of a selected tab in the action header.",
	"lakeus-theme-designer-color-accent-header-tab-new": "A label of a setting. The text color of a red link tab in the action header.",
	"lakeus-theme-designer-sticky-toc": "A form section title. Settings in this section will affect Sticky table of contents.",
	"lakeus-theme-designer-background-color-toc-button": "A label of a setting. The background color of the sticky table of contents button.",
	"lakeus-theme-designer-icon-filter-toc-button": "A label of a setting. The filter of the sticky table of contents button's icon.",
	"lakeus-theme-designer-text-color-sticky-toc-number": "A label of a setting. The text color of the title numbers in the sticky table of contents.",
	"lakeus-theme-designer-danger-zone": "A form section title. Settings in this section will affect the current input in the form."
}
